
[
{
    "id": "1",
    "category": "cms",
    "title": "WordPress 5",
    "subtitle": "Un CMS pour créer et gérer blogs et sites web",
    "author": "Christophe AUBRY",
    "isbn": "978-2-409-01883-1",
    "cover": "https://splashbase.s3.amazonaws.com/unsplash/regular/tumblr_mnh0n9pHJW1st5lhmo1_1280.jpg",
    "year": "2019",
    "price": "39.92",
    "description": "WordPress est actuellement l'outil de création et de gestion de sites web le plus utilisé dans le monde. Ce CMS (Content Management System) vous permet de créer et de gérer des blogs, comme des sites web plus institutionnels et vous propose une interface de gestion de vos sites, simple mais très efficace.\r\n\r\nDans ce livre, vous commencerez par installer WordPress en local sur votre machine et chez les hébergeurs professionnels. Vous découvrirez ensuite l'interface de gestion de WordPress et apprendrez à configurer votre site.\r\n\r\nVous verrez ensuite comment créer le contenu rédactionnel de votre site : créer et gérer les articles à l’aide du nouvel éditeur Gutenberg, les organiser grâce aux catégories et mots-clefs, administrer la publication de vos articles, créer les pages et gérer les menus de navigation.\r\n\r\nVous verrez comment importer des médias dans la bibliothèque et vous compléterez vos contenus en y ajoutant des images. Pour rendre votre site attractif, vous pourrez générer de l'interaction avec les visiteurs grâce aux commentaires.\r\n\r\nSi plusieurs personnes sont amenées à travailler sur le contenu de votre site, vous pourrez exploiter les nombreuses fonctionnalités de WordPress relatives à la gestion des utilisateurs afin de définir des rôles donnant des droits spécifiques à chacun dans l'administration du site.\r\n\r\nVous verrez comment étendre les fonctionnalités natives de WordPress en installant des extensions (plugins) et comment modifier l'apparence de votre site grâce aux thèmes. Nous terminerons ce livre en apprenant à sauvegarder le site et à le restaurer, pour passer du site local, sur votre machine, au site de production, sur le Web."
},
{
    "id": "2",
    "category": "cms",
    "title": "WordPress - Développez avec PHP",
    "subtitle": "extensions, widgets et thèmes avancés (théorie, TP, ressources) (3e édition)",
    "author": "Laurent DUMOULIN",
    "isbn": "978-2-409-01657-8",
    "cover": "https://splashbase.s3.amazonaws.com/unsplash/regular/tumblr_mnh0n9pHJW1st5lhmo1_1280.jpg",
    "year": "2018",
    "price": "58.75",
    "description": "Ce livre sur WordPress (en version 4.9 au moment de l'écriture) s'adresse aux développeurs professionnels, autodidactes et passionnés ayant des connaissances en PHP. Il permet de comprendre les rouages de ce CMS et d'acquérir une maîtrise du développement d'extensions en PHP en suivant un apprentissage progressif.\r\n\r\nL'auteur présente l'interaction entre PHP et le backoffice du CMS à travers plusieurs exemples qui évoluent de la programmation procédurale vers la programmation orientée objet en passant par l'utilisation de requêtes SQL. Il présente ensuite l'interaction avec AJAX\/JSON.\r\n\r\nLe lecteur apprend à installer WordPress, à utiliser l'outil d'administration, à ajouter des fonctionnalités, à utiliser des extensions pour les développeurs, à enregistrer en base de données, à ajouter des tables pour maîtriser complètement les principes de fonctionnement du CMS et apprendre ensuite à réaliser des thèmes avancés, des widgets, des extensions. Une partie du livre traite de l'optimisation, de la sécurité, de la traduction, de la mise en ligne...\r\n\r\nLes fonctions propres à WordPress sont détaillées avec des exemples et mises en situation à travers des travaux pratiques : création et ajout de fonctionnalités dans l'administration d'un thème, création d'un thème à partir d'une maquette HTML, ajout d'un éditeur wysiwyg, création d'une extension fil d’Ariane, création d'un widget, création d'une extension Google Maps, création d'une extension avec un formulaire pour récupérer des adresses mails en AJAX\/JSON.\r\n\r\nDes liens vers le guide de références ainsi que le champ lexical utilisé donneront les clés nécessaires pour approfondir les connaissances sur un sujet précis."
},
{
    "id": "3",
    "category": "cms",
    "title": "Joomla! 3.8",
    "subtitle": "Créez et gérez votre site web",
    "author": " Didier MAZIER",
    "isbn": "978-2-409-01130-6",
    "cover": "https://xwvhig.sn.files.1drv.com/y4musV9gj7p3e7Vw_QjGqDXqHiyIR6QO3ekUhgWLARjW5AI-MoWcpBqo0uOObfPeDKcmZNbbQAcfp3uudItwTAcYRCmw6irr7px8kx4dlFMQasQDr2OJ4EftFjQxOhEVEibDSi4AqxFCPKKsGQnKYwqe-r-I4cYzLq1uWC1kx_H63JVFk7-DV8H-Qu2J0nJKefNghiFlET8X3Yp0qrrqQ7AGA?width=413&height=502&cropmode=none",
    "year": "2017",
    "price": "39.92",
    "description": "Joomla! est un des meilleurs CMS (Content Management System - Système de gestion de contenu) ; gratuit, il permet de créer des sites web puissants et se distingue de ses concurrents par des fonctionnalités nativement très poussées. Depuis la version 3, il propose une architecture MVC performante, un design responsif (s'adaptant aux mobiles) basé sur Bootstrap, une rapidité de traitement accrue ainsi que fiabilité et sécurité. La version 3.8, avec des avancées comme les champs personnalisables, offre des applications multiples : e-commerce, éducation, réseaux sociaux…\r\n\r\nCe livre s'adresse aux débutants comme aux utilisateurs plus aguerris qui veulent découvrir les atouts de la version 3.8. Il donne des explications détaillées étape par étape pour une prise en main progressive de cette version de Joomla! pour construire des sites performants.\r\n\r\nVous verrez comment installer et configurer un site sous Joomla!, comment tirer parti de la gestion avancée des droits d'accès et d'édition pour des utilisateurs multiples, comment gérer l'aspect graphique du site avec les templates (modèles graphiques) et comment utiliser des frameworks (plateformes de travail) qui vous feront gagner un temps précieux dans la personnalisation de votre site en vous évitant de tirer des lignes de code fastidieuses !\r\n\r\nVous comprendrez comment le contenu est structuré et comment déployer la meilleure organisation des articles, catégories, champs et modules."
},
{
    "id": "4",
    "category": "cms",
    "title": "PrestaShop 1.7 (2e édition)",
    "subtitle": "Créer un site de e-commerce",
    "author": "Didier MAZIER",
    "isbn": "978-2-409-02310-1",
    "cover": "https://via.placeholder.com/1024",
    "year": "2020",
    "price": "39.92",
    "description": "Avec ce livre, rédigé avec la version 1.7.6 de PrestaShop, suivez pas à pas toutes les étapes pour installer et paramétrer votre site e-commerce, depuis l'hébergement jusqu'au suivi de l'activité en passant par la personnalisation graphique. Apprenez à paramétrer la boutique pour organiser vos ressources (équipe, transporteurs...), en définir le périmètre (zones, pays...) et les conditions d'application (devises, taxes, modes de paiement, gestion des expéditions...). Structurez ensuite votre catalogue en définissant les catégories de produits, puis les marques distribuées et les fournisseurs auxquels vous ferez appel ; spécifiez les attributs et leurs valeurs ainsi que les caractéristiques avant de créer efficacement les produits proposés par votre site e-commerce.\r\n\r\nLes fonctions marketing et merchandising sont présentées en détail pour dynamiser les ventes avec des actions efficaces : produits phares, promotions, ventes croisées, navigation à facettes (filtrage de l'affichage des produits par critères)...\r\n\r\nVotre site est fin prêt, tous les réglages sont spécifiés, votre catalogue est terminé, les promotions sont en route... Place aux ventes ! Un chapitre est consacré au processus d'achat dans toutes ses étapes à la fois côté client (Front Office) et administration (Back Office) ; mettez en œuvre tous les mécanismes commerciaux clés du e-commerce, garants de la satisfaction de vos clients : retours produits, avoirs, relances des commandes..."
},
{
    "id": "5",
    "category": "cms",
    "title": "Drupal 7",
    "subtitle": "Concevoir et administrer vos sites web",
    "author": "Christophe AUBRY",
    "isbn": "978-2-746-00646-7",
    "year": "2011",
    "price": "39.92",
    "description": "Drupal est certainement l'outil de conception et de gestion de sites web (CMS) le plus modulable, le plus personnalisable et parmi les plus puissants. Du fait même de son architecture interne, il permet de concevoir, administrer et personnaliser de manière très précise un site web.\r\n\r\nCe livre Drupal va vous apprendre à installer, configurer et utiliser l'interface d'administration de vos sites web.\r\nDrupal permettant une administration très précise des droits utilisateurs, nous détaillerons largement la gestion des utilisateurs. Une des grandes forces de Drupal est la possibilité de personnaliser et de créer des types de contenu qui vont répondre à tous vos besoins en matière d'organisation et d'affichage de l’information. L'administration des commentaires est tout aussi personnalisable et efficace. De plus, Drupal permet l'ajout de fonctionnalités supplémentaires par l'intermédiaire de modules puissants et adaptables à vos besoins. Enfin, le design de vos sites web sera confié à des thèmes qui afficheront vos sites avec la structure, l'organisation et la navigation que vous aurez définis."
},
{
    "id": "6",
    "category": "cms",
    "title": "Drupal 8",
    "subtitle": "Découverte des fondamentaux",
    "author": "Christophe AUBRY",
    "isbn": "978-2-746-09835-0",
    "year": "2015",
    "price": "39.92",
    "description": "Drupal est certainement l'outil de conception et de gestion de sites web (CMS) le plus modulable, le plus personnalisable et parmi les plus puissants. Du fait même de son architecture interne, il permet de concevoir, administrer et personnaliser de manière très précise un site web.\r\n\r\nCe livre s'adresse aux débutants : il a comme objectif de vous faire découvrir les fonctionnalités essentielles de Drupal 8 vous permettant de créer et administrer un site web.\r\n\r\nAprès l'installation, la découverte de l'administration du site et la configuration du CMS, vous apprendrez à créer et à gérer les différents types de contenu : les articles et les pages. Vous apprendrez à gérer les formulaires et les champs pour la saisie de ces contenus pour les rédacteurs. Pour ces mêmes rédacteurs, vous apprendrez à gérer les éditeurs de texte utilisés pour la mise en forme des contenus rédactionnels. Vous verrez comment afficher les contenus dans l'interface d'administration des rédacteurs et comment, à l'aide des blocs, gérer leur affichage dans la page d'accueil et dans la barre de navigation. "
},
{
    "id": "7",
    "category": "cms",
    "title": "WordPress et WooCommerce",
    "subtitle": "Créer votre boutique en ligne",
    "author": "Christophe AUBRY",
    "isbn": "978-2-409-01090-3",
    "year": "2017",
    "price": "39.92",
    "description": "Le succès des boutiques en ligne ne se démontre plus, tout comme celui du CMS WordPress utilisé pour la conception de plus d'un tiers des sites web dans le monde. Avec l'extension WooCommerce, vous obtenez le duo gagnant pour lancer votre activité de vente en ligne.\r\n\r\nDans cet ouvrage, vous commencerez par installer WordPress (version 4.8) et WooCommerce, en local sur votre machine sous Windows ou MacOS. Ensuite vous apprendrez à gérer la structure (la page d'accueil, les menus, les widgets) et l'affichage de votre boutique (le thème d'affichage, personnaliser l'en-tête, la mise en page, les boutons...).\r\n\r\nEnsuite, vous paramétrerez votre boutique avec la gestion des livraisons (les zones de livraison avec leur pays de destination) et des paiements (par chèque, carte bleue, PayPal...).\r\n\r\nUn chapitre important est consacré à la gestion des produits mis en vente. Vous apprendrez à mettre en vente tous les types de produits que propose WooCommerce : les produits simples, les attributs, les produits groupés, les produits variables... et à offrir des promotions sur certains produits."
},
{
    "id": "8",
    "category": "ia",
    "title": "Les Blockchains",
    "subtitle": "De la théorie à la pratique, de l'idée à l'implémentation (2e édition)",
    "author": "Billal CHOULI",
    "isbn": "978-2-409-02205-0",
    "year": "2019",
    "price": "78.75",
    "description": "Ce livre offre une vision à 360 degrés de l'état de l'art de la technologie Blockchain, son environnement et son potentiel, à un public désireux d'en faire sa spécialité en lui fournissant les clés pour se l'approprier. Bien plus qu'une cryptomonnaie, la Blockchain est une pépite de technologie, à la croisée des concepts cryptographiques bien implémentés et d'une architecture décentralisée opérationnelle en environnement de production.\r\n\r\nDans un premier temps, les auteurs présentent les promesses de la technologie pour permettre au lecteur de faire le tri sur l'information et la désinformation disponibles sur le web. Il découvre ainsi les réels intérêts de la technologie au-delà de la cryptomonnaie. Puis un chapitre présente la Blockchain grâce à une définition de la technologie, de ses composants et mécanismes à l'oeuvre, permettant de mieux la comprendre et de s'en approprier les piliers.\r\n\r\nUn chapitre, davantage dédié aux profils de chefs de projet, détaille ensuite la Blockchain selon un axe métier. Le lecteur est accompagné pour comprendre le processus de définition du cas d'usage, choisir la technologie adaptée, évaluer les coûts. Le contexte légal est présenté ainsi que différents cas d'usage permettant de donner une culture générale sur les différentes technologies, leur exploitation et leur intégration aux écosystèmes existants.\r\n\r\nDans un autre chapitre, davantage orienté sur l'axe technique, les concepts sous-jacents à la Blockchain sont présentés avec plus de profondeur. Les architectes solutions et techniques y trouveront des éléments d'architecture leur permettant de se projeter dans la mise en oeuvre de cette technologie et les développeurs verront comment déployer les principales technologies grâce à des exemples détaillés pas à pas."
},
{
    "id": "9",
    "category": "ia",
    "title": "Intelligence artificielle vulgarisée",
    "subtitle": "Le Machine Learning et le Deep Learning par la pratique",
    "author": "Aurélien VANNIEUWENHUYZE",
    "isbn": "978-2-409-02073-5",
    "year": "2019",
    "price": "43.63",
    "description": "L'intelligence artificielle est aujourd'hui incontournable. Ce livre a pour objectif de présenter de façon vulgarisée les concepts du Machine Learning et du Deep Learning pour les mettre en application dans des projets basés sur de l'intelligence artificielle, en mettant de côté autant que possible les formules mathématiques et statistiques. Il s'adresse avant tout aux développeurs mais intéressera également toute personne novice en la matière.\r\n\r\nAvec une démarche progressive, chaque notion étudiée dans ce livre est illustrée par des cas pratiques écrits en langage Python. Des connaissances dans ce langage sont ainsi un plus.\r\n\r\nAprès une introduction à l'intelligence artificielle et l'identification des craintes qu'elle suscite, l'auteur propose quelques rappels sur les fondamentaux du langage Python ainsi qu'une révision de certaines notions statistiques pour appréhender au mieux les algorithmes du Machine Learning. Le lecteur peut ensuite mettre en pratique certains de ces algorithmes et découvrir comment donner la faculté à sa machine de prédire des valeurs et de réaliser des classifications.\r\n\r\nVient ensuite l'étude de l'apprentissage non supervisé et de l'usage des réseaux de neurones qui permet de surcroît au lecteur de découvrir comment les neurosciences ont eu un impact sur l'intelligence artificielle. Le livre se termine avec la réalisation de cas pratiques : un premier mêlant réseau de neurones et parole et un second relatif au premier chatbot."
},
{
    "id": "10",
    "category": "ia",
    "title": "Intelligence Artificielle et Cognitive business",
    "subtitle": null,
    "author": "Jean-Michel RODRIGUEZ",
    "isbn": "978-2-409-01342-3",
    "year": "2018",
    "price": "65.65",
    "description": "L'Intelligence Artificielle ou IA est au cœur de nombreux débats et est le fer de lance de la majorité des entreprises. Il ne se passe plus une journée sans qu'une communication ne soit faite sur une nouvelle intelligence artificielle capable d'en faire plus que la précédente. La guerre industrielle est lancée et tout prête à imaginer qu'elle ne se terminera que par une entité artificielle égale ou supérieure à l'humain. C'est dans ce nouveau monde qui se prépare qu'apparaît la branche cognitive de l'intelligence artificielle qui s'appuie sur des domaines et outils tels que l'apprentissage et l'auto-apprentissage, les réseaux de neurones, la langue naturelle, les arbres de décision, et dont les objectifs sont de déduire des faits marquants, repérer des motifs, prédire des tendances, imaginer de nouveaux services à mettre en place et ainsi aider l'humain à décider.\r\n\r\nJ'ai voulu ce livre accessible au plus grand nombre, même s'il aborde parfois des points techniques assez pointus, chacun pourra y trouver les informations au niveau qu'il le désire ainsi que des sources d'information qui lui permettront, si nécessaire, d'aller plus loin.\r\n\r\nLa structure de ce livre est une progression, néanmoins les chapitres peuvent être abordés séparément. Je décris tout d'abord les aspects et les domaines de l'intelligence artificielle, j'aborde ensuite les différents types de données et leur utilisation, puis je détaille le processus cognitif et par extension ce qu'est le « Cognitive Business». Un chapitre est consacré à la transformation digitale des entreprises et je fournis des exemples concrets de cette digitalisation. Enfin, pour terminer ce livre, je fais le tour des futurs probables de l'intelligence artificielle, leurs avantages et leurs risques, tels qu'ils sont décrits par certains de nos scientifiques, chercheurs et entrepreneurs."
},
{
    "id": "11",
    "category": "ia",
    "title": "L'Intelligence Artificielle pour les développeurs",
    "subtitle": "Concepts et implémentations en Java (2e édition)",
    "author": "Virginie MATHIVET",
    "isbn": "978-2-409-01709-4",
    "year": "2019",
    "price": "65.65",
    "description": "Ce livre sur l'Intelligence Artificielle s'adresse particulièrement aux développeurs et ne nécessite pas de connaissances mathématiques approfondies. Au fil des chapitres, l'auteur présente les principales techniques d'Intelligence Artificielle et, pour chacune d'elles, les inspirations biologiques, physiques voire mathématiques, puis les différents concepts et principes (sans entrer dans les détails mathématiques), avec des exemples et figures pour chacun de ceux-ci. Les domaines d'application sont illustrés par des applications réelles et actuelles. Chaque chapitre contient un exemple d'implémentation générique, complété par une application pratique, développée en Java. Ces exemples de code étant génériques, ils sont facilement adaptables à de nombreuses applications Java 10, sans plugin extérieur. Les techniques d'Intelligence Artificielle décrites sont :\r\n\r\n- Les systèmes experts, permettant d'appliquer des règles pour prendre des décisions ou découvrir de nouvelles connaissances.\r\n- La logique floue, permettant de contrôler des systèmes informatiques ou mécaniques de manière beaucoup plus souple que les programmes traditionnels.\r\n- Les algorithmes de recherche de chemin, dont le A* très utilisé dans les jeux vidéo pour trouver les meilleurs itinéraires.\r\n- Les algorithmes génétiques, utilisant la puissance de l'évolution pour apporter des solutions à des problèmes complexes.\r\n- Les principales métaheuristiques, dont la recherche tabou, trouvant des optimums à des problèmes d'optimisation, avec ou sans contraintes.\r\n- Les systèmes multi-agents, simulant des foules ou permettant des comportements émergents à partir de plusieurs agents très simples.\r\n- Les réseaux de neurones (et le deep learning), capables de découvrir et de reconnaître des modèles, dans des suites historiques, des images ou encore des données."
},
{
    "id": "12",
    "category": "ia",
    "title": "L'Intelligence Artificielle pour les développeurs",
    "subtitle": "Concepts et implémentations en C# (2e édition)",
    "author": "Virginie MATHIVET",
    "isbn": "978-2-409-01140-5",
    "year": "2017",
    "price": "65.65",
    "description": "Ce livre sur l'Intelligence Artificielle s'adresse particulièrement aux développeurs et ne nécessite pas de connaissances mathématiques approfondies. Au fil des chapitres, l'auteur présente les principales techniques d'Intelligence Artificielle et, pour chacune d'elles, les inspirations biologiques, physiques voire mathématiques, puis les différents concepts et principes (sans entrer dans les détails mathématiques), avec des exemples et figures pour chacun de ceux-ci. Les domaines d'application sont illustrés par des applications réelles et actuelles. Chaque chapitre contient un exemple d'implémentation générique, complété par une application pratique, développée en C#. Ces exemples de code étant génériques, ils sont facilement adaptables à de nombreuses applications C#, que ce soit dans des applications .NET classiques, pour ASP.NET, ou encore des applications Windows (versions 8 et 10). Les techniques d'Intelligence Artificielle décrites sont :\r\n\r\n- Les systèmes experts, permettant d'appliquer des règles pour prendre des décisions ou découvrir de nouvelles connaissances.\r\n- La logique floue, permettant de contrôler des systèmes informatiques ou mécaniques de manière beaucoup plus souple que les programmes traditionnels.\r\n- Les algorithmes de recherche de chemin, dont le A* très utilisé dans les jeux vidéo pour trouver les meilleurs itinéraires.\r\n- Les algorithmes génétiques, utilisant la puissance de l'évolution pour apporter des solutions à des problèmes complexes.\r\n- Les principales métaheuristiques, dont la recherche tabou, trouvant des optimums à des problèmes d'optimisation, avec ou sans contraintes.\r\n- Les systèmes multi-agents, simulant des foules ou permettant des comportements émergents à partir de plusieurs agents très simples.\r\n- Les réseaux de neurones (ou deep learning), capables de découvrir et de reconnaître des modèles, dans des suites historiques, des images ou encore des données."
},
{
    "id": "13",
    "category": "ia",
    "title": "TensorFlow et Keras",
    "subtitle": "L'intelligence artificielle appliquée à la robotique humanoïde",
    "author": "Henri LAUDE",
    "isbn": "978-2-409-02199-2",
    "year": "2019",
    "price": "78.76",
    "description": "Ce livre sur TensorFlow et sur son API intégrée Keras contient toutes les informations nécessaires pour assister le lecteur dans la mise au point, pas à pas, d'une intelligence artificielle reposant sur les pratiques courantes du deep learning et du machine learning. Autour de l'usage de notions associées aux tenseurs et à la différentiation qui représentent les deux points forts du framework, l'auteur présente dans ce livre un projet d'intelligence artificielle incarnée : celui d'un robot humanoïde.\r\n\r\nAinsi, en plus des notions de base de la robotique, les principaux savoir-faire permettant de coder la partie algorithmique de la création de cette IA incarnée sont traités. Principalement construit à partir d'algorithmes liés à la cognition et à la prise de décision se mettant naturellement en œuvre via Keras, ce parcours didactique permet donc au lecteur d'étudier :\r\n\r\n- la gestion de cinématique et la planification de trajectoire ;\r\n- le contrôle-commande et l'asservissement ;\r\n- la reconnaissance visuelle d'objets ;\r\n- le traitement du son ;\r\n- le langage naturel ;\r\n- la génération de séquences ou d'images\r\n- et, de façon plus générale, l'automatisation des calculs d'ingénierie relatifs aux grandes matrices, aux très grands tenseurs multidimensionnels et à la différentiation de fonctions très élaborées."
},
{
    "id": "14",
    "category": "ia",
    "title": "Botkit",
    "subtitle": "Développez vos bots avec JavaScript et Node.js",
    "author": "Christophe BOUVARD",
    "isbn": "978-2-409-01664-6",
    "year": "2018",
    "price": "78.75",
    "description": "Avec l'omniprésence des applications de messagerie sur les smartphones, de nouvelles expériences utilisateurs naissent comme des agents conversationnels, plus couramment appelés bots (ou chatbots). Ce livre sur Botkit s'adresse ainsi aux développeurs qui souhaitent structurer et accélérer le développement de bots grâce à la puissance d'un écosystème Node.js\/JavaScript.\r\n\r\nDes connaissances en programmation avec le langage JavaScript et sur le fonctionnement de sites et applications web sont requises pour la bonne lecture de ce livre.\r\n\r\nLe lecteur commence par découvrir les grands principes des bots et leur architecture avant d'explorer les possibilités offertes par Botkit pour la conception et l'élaboration de bots. Il apprend ensuite à entraîner un moteur d'intelligence artificielle pour doper les capacités du bot dans l'analyse des messages en langage naturel. L'auteur s'appuie pour cela sur l'étude de quatre technologies : Watson d'IBM, LUIS de Microsoft, Dialogflow de Google et Recast du groupe SAP.\r\n\r\nDans la suite du livre, l'auteur réalise quatre implémentations complètes de bots qui s'appuient chacune sur une grande plateforme de messagerie :\r\n- Un bot Météo pour Facebook Messenger ;\r\n- Un bot Actualités pour Skype ;\r\n- Un bot Kanban alimenté par Trello pour Slack ;\r\n- Un bot Commerce prêt à l'emploi pour les sites web de e-commerce.\r\n\r\nPour finir, un chapitre apporte les connaissances nécessaires pour héberger son bot dans le Cloud."
},
{
    "id": "15",
    "category": "ia",
    "title": "Intelligence artificielle avec AWS",
    "subtitle": "Exploitez les services cognitifs d'Amazon",
    "author": "Marc ISRAEL",
    "isbn": "978-2-409-01945-6",
    "year": "2019",
    "price": "56.89",
    "description": "L'intelligence artificielle est autant un sujet à la mode qu'une réalité quotidienne. Ce livre s'adresse à tout professionnel IT qui souhaite apprendre de façon très pragmatique à l'utiliser et l'intégrer aux applications d'entreprise en s'appuyant sur les services cognitifs d'Amazon. En effet, bénéficier du cloud d'Amazon pour utiliser l'IA permet d'avoir accès à des serveurs puissants, à l'accumulation des données d'Amazon et à des algorithmes d'IA.\r\n\r\nPour suivre les nombreux exemples fournis, un compte AWS est nécessaire et peut être obtenu gratuitement à l'adresse https:\/\/aws.amazon.com\/fr\/. Quelques connaissances en C#, Python et en traitement de données sont recommandées.\r\n\r\nAprès un rapide état de l'art permettant au lecteur de découvrir les concepts sous-jacents de l'intelligence artificielle (système expert et apprentissage machine, inférences, heuristiques, modèles, fonctions ou encore réseaux de neurones et Big Data), l'auteur présente l'environnement AWS et différents services cognitifs dédiés à l'IA. Le lecteur découvre ainsi le service de vision par ordinateur avec Rekognition, le traitement automatique du langage naturel avec Transcribe, Polly, Comprehend, Translate et Lex ou encore les prévisions numériques avec SageMaker et les réseaux de neurones formels."
},
{
    "id": "16",
    "category": "ia",
    "title": "AWS",
    "subtitle": "Gérez votre infrastructure sur la plateforme cloud d'Amazon",
    "author": "Nicolas DUMINIL",
    "isbn": "978-2-409-02218-0",
    "year": "2019",
    "price": "56.88",
    "description": "Cet ouvrage propose un voyage au coeur de la plateforme cloud Amazon Web Services et de ses services lors duquel le lecteur trouvera toutes les informations nécessaires sur la conception, le développement et l'administration d'une infrastructure AWS. Il s'adresse à toute personne qui souhaite explorer les subtilités du cloud computing et des principaux services d'AWS pour faire tourner ses applications.\r\n\r\nAprès une introduction au Cloud Computing et à la plateforme AWS permettant de bien démarrer, le lecteur est rapidement invité à découvrir comment créer, explorer et supprimer une infrastructure. Puis, l'auteur étudie la question de la sécurité et de la gestion de l'accès à une infrastructure grâce à la console IAM ou via AWS CLI et Terraform.\r\n\r\nDans la suite des chapitres, la mise en oeuvre des principaux services d'AWS est détaillée. Illustrés par la pratique grâce à de nombreux exemples concrets d'utilisation, le lecteur peut ainsi trouver un maximum d'informations sur les services :\r\n\r\n- EC2 pour la gestion des images, des instances et des réseaux ;\r\n- S3 ou Elastic Block Store (EBS) pour le stockage ;\r\n- CloudWatch pour la surveillance d'une infrastructure AWS ;\r\n- VPC pour l'utilisation de Cloud privé virtuel ;\r\n- RDS pour la gestion des bases de données ;\r\n- et Route53 pour la gestion des noms de domaines."
},
{
    "id": "17",
    "category": "langage",
    "title": "Langage R - Prendre en main les statistiques",
    "subtitle": "Complément vidéo : Accéder à tous types de données",
    "author": "Aline DESCHAMPS",
    "isbn": "978-2-409-02155-8",
    "year": "2019",
    "price": "58.22",
    "description": "Ce livre de la collection vBook se compose d'un livre de référence sur le langage R pour lever la complexité apparente de ce puissant langage et permettre une prise en main aisée des statistiques de premier cycle et d'un approfondissement sous forme de vidéo pour apprendre à récupérer des données issues de diverses sources avec ce langage dédié à la Data Science.\r\n\r\n\r\nLivre Langage R - Prendre en main les statistiques\r\n\r\nR est un langage statistique très riche en fonctionnalités de traitement des données. Il permet l'extraction de données de sources variées, leur traitement et leur organisation. Plus encore, la multiplicité des systèmes de visualisation graphique et les nombreuses fonctions de modélisation statistique font de ce langage un outil statistique redoutable.\r\n\r\nAvec ce livre, les auteurs proposent une présentation de R ayant pour objectif de lever la complexité apparente de ce puissant langage et de permettre une prise en main aisée des statistiques de premier cycle.\r\n\r\nDans la première partie du livre, le lecteur découvre de manière détaillée les fondamentaux du langage R : les variables et la syntaxe des opérations de base, les structures de données, les outils du langage pour programmer notamment les structures de contrôles, les fonctions et même la conception de packages.\r\n\r\nDans la seconde partie, les auteurs traitent des problématiques métiers liées aux outils d'importation et d'exportation de données, d'analyse basique et de visualisation des données, aux outils de simulation et d'inférences statistiques et aux modèles statistiques classiques (ANOVA, régression linéaire, etc.)."
},
{
    "id": "18",
    "category": "langage",
    "title": "PHP 7",
    "subtitle": "Développez un site web dynamique et interactif (2e édition)",
    "author": "Olivier HEURTEL",
    "isbn": "978-2-409-01511-3",
    "year": "2018",
    "price": "50.35",
    "description": "Ce livre sur PHP 7 (en version 7.2 au moment de l'écriture) s'adresse aux concepteurs et développeurs qui souhaitent utiliser PHP pour développer un site web dynamique et interactif.\r\n\r\nAprès une présentation des principes de base du langage, l'auteur se focalise sur les besoins spécifiques du développement de sites dynamiques et interactifs et s'attache à apporter des réponses précises et complètes aux problématiques habituelles (gestion des formulaires, accès aux bases de données, gestion des sessions, envoi de courriers électroniques...).\r\n\r\nPour toutes les fonctionnalités détaillées, de nombreux exemples de code sont présentés et commentés. Ce livre didactique, à la fois complet et synthétique, vous permet d'aller droit au but ; c'est l'ouvrage idéal pour se lancer sur PHP.\r\n\r\nDes éléments complémentaires sont en téléchargement sur le site www.editions-eni.fr."
},
{
    "id": "19",
    "category": "langage",
    "title": "PHP et MySQL",
    "subtitle": "Maîtrisez le développement d'un site web dynamique et interactif (4e édition)",
    "author": "Olivier HEURTEL",
    "isbn": "978-2-409-02135-0",
    "year": "2019",
    "price": "43.63",
    "description": "Ce livre sur PHP et MySQL s'adresse aux concepteurs et développeurs qui souhaitent utiliser PHP et MySQL pour développer un site web dynamique et interactif.\r\n\r\nDans la première partie du livre, l'auteur présente la mise en œuvre d'une base de données MySQL : langage SQL (Structured Query Language), utilisation des fonctions MySQL, construction d'une base de données (tables, index, vues), sans oublier les techniques avancées comme la gestion des transactions, la recherche en texte intégral ou le développement de procédures stockées.\r\n\r\nDans la deuxième partie du livre, après une présentation des fonctionnalités de base du langage PHP, l'auteur se focalise sur les besoins spécifiques du développement de sites dynamiques et interactifs en s'attachant à apporter des réponses précises et complètes aux problématiques habituelles : gestion des formulaires, gestion des sessions, envoi de courriers électroniques et bien sûr accès à une base de données MySQL.\r\n\r\nAbondamment illustré d'exemples commentés, ce livre (écrit sur les versions 7.3 de PHP et 8.0 de MySQL) est à la fois complet et synthétique et vous permet d'aller droit au but."
},
{
    "id": "20",
    "category": "langage",
    "title": "Java 11",
    "subtitle": "Les fondamentaux du langage (avec exercices pratiques et corrigés)",
    "author": "Thierry GROUSSARD",
    "isbn": "978-2-409-02060-5",
    "year": "2019",
    "price": "43.63",
    "description": "Ce livre s'adresse à tout informaticien désirant développer sous Java. Que le lecteur soit débutant ou qu'il ait déjà une première expérience avec un autre langage, il trouvera dans cet ouvrage toutes les bases nécessaires pour se familiariser rapidement avec un des langages les plus utilisés au monde.\r\n\r\nAprès une présentation de la plateforme Java SE, de son installation sous Windows et Linux et de l'environnement de développement utilisé dans le cadre de l'ouvrage (Eclipse, MySQL), le lecteur étudie les bases du langage et la programmation orientée objet. Parmi la richesse de l'API Java, un focus est fait sur l'API de gestion des dates, sur les nouvelles possibilités offertes par les interfaces et sur la notion de modules.\r\n\r\nLes expressions lambda et les API sous-jacentes comme l'API java.util.function ou l'API Stream sont détaillées avant de passer à l'étude du développement d'applications graphiques avec la bibliothèque Swing. Le développement d'applications client\/serveur est également présenté avec l'API JDBC assurant l'accès aux bases de données relationnelles.\r\n\r\nLe déploiement étant une étape importante du succès d'une application, le dernier chapitre présente la distribution d'une application avec la solution classique des fichiers d'archives ou l'utilisation de l'outil jlink.\r\n\r\nDe nombreux exercices avec leurs corrigés permettent au lecteur de valider ses connaissances et de mettre en pratique immédiatement les notions étudiées."
},
{
    "id": "21",
    "category": "langage",
    "title": "C# 8 et Visual Studio 2019",
    "subtitle": "Les fondamentaux du langage",
    "author": "Sébastien PUTIER",
    "isbn": "978-2-409-02280-7",
    "year": "2019",
    "price": "43.63",
    "description": "Ce livre s'adresse aux développeurs souhaitant maîtriser le développement d'applications .NET avec le langage C# dans sa version 8.\r\n\r\nAprès un tour d'horizon de la plateforme .NET et une description des outils fournis par l'environnement Visual Studio 2019, le lecteur découvrira progressivement les éléments clés du langage C# et la programmation orientée objet, jusqu'à pouvoir appliquer ce concept au développement d'applications Windows avec WPF. Une initiation aux techniques de débogage avec Visual Studio lui permettra de parfaire sa maîtrise de l'outil.\r\n\r\nLe développement d'applications client-serveur est ensuite traité par le thème de l'accès aux données avec ADO.NET. Une description complète de LINQ au travers d'exemples concrets montre comment ses fonctionnalités simplifient la manipulation des données. Son utilisation est notamment présentée dans le cadre de l'accès au contenu d'une base de données SQL Server avec Entity Framework Core. Un chapitre est ensuite consacré à la manipulation de données au format XML, permettant l'échange de données entre applications d'une manière simple et standardisée. La fin du cycle de développement est traitée à travers le déploiement d'une application avec les technologies Windows Installer, ClickOnce et MSIX.\r\n\r\nAfin d'aider le lecteur dans son apprentissage, un aide-mémoire est fourni ; il résume l'utilité des mots-clés C# traités dans le livre."
},
{
    "id": "22",
    "category": "langage",
    "title": "JavaScript - Apprendre à développer (2e édition)",
    "subtitle": "Complément vidéo : Programmation Orientée Objet avec JavaScript",
    "author": "Cédric MILLAURIAUX",
    "isbn": "978-2-409-01875-6",
    "year": "2019",
    "price": "58.22",
    "description": "Ce livre sur l'apprentissage du développement avec JavaScript s'adresse à des lecteurs qui souhaitent maîtriser cette brique incontournable des développements web (applications\/serveurs web et applications hybrides pour smartphones). En effet, même si des solutions logicielles existent pour contourner la connaissance du langage JavaScript, sa maîtrise est un atout essentiel pour acquérir une expertise dans le domaine des technologies du Web 2.0.\r\n\r\nEn prenant le parti que le lecteur n'a que des connaissances minimales en programmation, l'auteur débute par des rappels ou des apports en algorithmie. Il explique ensuite les bases du langage JavaScript. Les différents concepts, principes ou fonctionnalités sont mis en œuvre au travers d'exemples concrets facilement réutilisables ensuite dans d'autres développements.\r\n\r\nLe livre permettra au lecteur de monter progressivement en compétences sur JavaScript en montrant les interactions avec d'autres technologies web (ou langages) comme l'incontournable HTML, les feuilles de styles CSS, les langages de script orientés serveurs comme PHP. Des sujets aussi importants que la Programmation Orientée Objet, les nouveautés de la version ECMAScript 6, la manipulation du DOM ou encore la gestion des cookies, le stockage local et distant, la géolocalisation, le dessin, les graphiques de gestion seront abordés au travers d'exemples concrets.\r\n\r\nDans cette troisième édition, l'auteur propose des exemples didactiques d'utilisation de JavaScript dans un contexte serveur avec la présentation du framework Angular et du serveur d'applications Node.js. Enfin, JavaScript faisant une percée très significative dans le monde du développement hybride sur les smartphones et tablettes, le livre se termine par un exposé complet sur le framework Ionic 3 avec de nombreux exercices présentant l'architecture et permettant d'aborder sereinement le développement d'applications plus complexes."
},
{
    "id": "23",
    "category": "langage",
    "title": "Python 3",
    "subtitle": "Traitement de données et techniques de programmation",
    "author": "Sébastien CHAZALLET",
    "isbn": "978-2-409-02292-0",
    "year": "2020",
    "price": "56.90",
    "description": "Ce livre sur le langage Python 3 s'adresse à tout professionnel de l'informatique, ingénieur, étudiant, enseignant ou même autodidacte qui souhaite maîtriser ce langage très abouti. L'objectif de ce livre est de montrer au lecteur ce que l'on peut faire avec le langage, du traitement de données à la création d'un site web, en passant par la gestion du système et du réseau. Pour bien appréhender son contenu, la lecture du livre dont il est la suite, Python 3 - Les fondamentaux du langage chez le même éditeur, est recommandée.\r\n\r\nLa première partie couvre le traitement de données avec la manipulation de fichiers, les fichiers de configuration, les formats d'import\/export, la gestion de la compression ou encore les flux XML ou la génération de documents.\r\n\r\nLa seconde partie présente la programmation système, la programmation réseau, la programmation web et la programmation scientifique, qui sont autant de niches dans lesquelles le langage Python excelle par sa simplicité d'utilisation autant que par sa couverture fonctionnelle exceptionnelle.\r\n\r\nLa troisième partie présente tous les outils de programmation concurrente, qu'il s'agisse de programmation asynchrone, parallèle ou distribuée. On notera que l'accent est mis sur de nombreuses techniques asynchrones, car il s'agit de l'un des points majeurs de l'évolution récente du langage Python."
},
{
    "id": "24",
    "category": "langage",
    "title": "Langage C",
    "subtitle": "Maîtriser la programmation procédurale (avec exercices pratiques)",
    "author": "Frédéric DROUILLON",
    "isbn": "978-2-409-01400-0",
    "year": "2018",
    "price": "43.63",
    "description": "Ce livre s'adresse aux développeurs débutants qui souhaitent maîtriser la conception algorithmique en s'appuyant sur le langage C. Il est particulièrement adapté aux étudiants en licence d'informatique, école d'ingénieur et prépa scientifique. L'efficacité, la modularité et la généricité du langage C vont permettre au lecteur d'acquérir un savoir-faire fondamental en programmation informatique.\r\n\r\nAu-delà du fonctionnement du langage, l'auteur fournit ce qu'il faut de précision et de pratique pour que le lecteur se l'approprie et le maîtrise ; chaque section théorique est suivie d'une section \"Mise en pratique\" dédiée, composée d'exercices diversifiés et une section \"Expérimentation\" propose des études de cas.\r\n\r\nLes sept premiers chapitres concernent l'apprentissage du langage C et les premières armes en algorithmique : des variables simples, unions, structures et tableaux jusqu'aux pointeurs avec les concepts de sauts, de branchements, de boucles et de fonctions. La suite du livre apporte des approfondissements avec l'étude des listes en C. Les listes chainées dynamiques, mais également les piles et les files ainsi que les arbres, essentiellement les arbres binaires, sont expliqués. Pour ce faire, un chapitre expose la récursivité, élément incontournable pour l'implémentation des arbres."
},
{
    "id": "25",
    "category": "langage",
    "title": "TypeScript",
    "subtitle": "Notions fondamentales",
    "author": "Félix BILLON ",
    "isbn": "978-2-409-02170-1",
    "year": "2019",
    "price": "43.63",
    "description": "Ce livre sur le langage TypeScript (en version 3.6 au moment de l'écriture) s'adresse aux développeurs, disposant déjà d'une pratique de programmation dans d'autres langages, qui souhaitent optimiser et sécuriser la production de code JavaScript dans un projet de développement. Si la connaissance basique du langage JavaScript est un plus pour la lecture de ce livre, elle n'est toutefois pas indispensable pour appréhender les différentes notions étudiées.\r\n\r\nDans le premier chapitre, les auteurs commencent par présenter les principes de fonctionnement du langage avant de mettre en place l'environnement de développement utilisé pour les exemples qui repose sur Visual Studio Code et Node.js. Puis, dans la suite des chapitres, le lecteur découvre les différentes fonctionnalités du langage (types, modules, décorateurs, généricité, asynchronisme, types avancés…) ainsi que les paradigmes de programmation possibles (programmation orientée objet et programmation fonctionnelle).\r\n\r\nPour finir, le dernier chapitre propose une mise en application des différentes notions étudiées au travers du développement, étape par étape, d'une application Node.js avec la bibliothèque Express.js. Il permet également de découvrir comment enrichir le fonctionnement d'une bibliothèque en utilisant les fonctionnalités de TypeScript et plusieurs patrons de conception (MVC, Repository, injection de dépendances)."
},
{
    "id": "26",
    "category": "langage",
    "title": "Python 3",
    "subtitle": "Les fondamentaux du langage (3e édition)",
    "author": "Sébastien CHAZALLET",
    "isbn": "978-2-409-02096-4",
    "year": "2019",
    "price": "56.76",
    "description": "Ce livre sur les fondamentaux du langage Python 3 (en version 3.8 beta au moment de l'écriture) s'adresse à tout professionnel de l'informatique, ingénieur, étudiant (et particulièrement en BTS Services Informatiques Organisations), enseignant ou même autodidacte, qui souhaite maîtriser ce langage très abouti. Il couvre un périmètre relativement large, détaille tout le cœur du langage et du traitement de données et ouvre des perspectives importantes sur tout ce que Python 3 permet de faire (de la création d'un site web au développement de jeux en passant par la conception d'une interface graphique avec Gtk). Le livre est consacré à la branche 3 de Python, et présente bien sûr les nouveautés apportées par la version 3.8. Toutefois, comme le langage Python 2 est encore très présent, lorsqu'elles existent, l'auteur présente les différences importantes avec la branche antérieure de Python.\r\n\r\nLa première partie du livre détaille les atouts de Python 3 pour répondre aux besoins des entreprises quel que soit le domaine informatique concerné.\r\n\r\nLa seconde partie est un guide à destination des débutants, que ce soit en Python ou en développement en général, elle permet d'aborder en douceur les concepts clés autour de projets servant de fil rouge et propose la réalisation de quelques exercices.\r\n\r\nLa troisième partie porte sur les fondamentaux du langage : les notions sont présentées progressivement avec des exemples de code qui illustrent chaque propos. L'auteur a souhaité que le lecteur atteigne une autonomie réelle dans son apprentissage, avec pour chaque notion présentée deux objectifs distincts : permettre à celui qui ne connaît pas la notion de se l'approprier correctement, notamment en respectant son rôle, et permettre à celui qui la connaît de trouver des angles d'attaques originaux pour aller le plus loin possible dans son exploitation.\r\n\r\nLa quatrième partie permet d'avoir un aperçu de l'utilisation des fonctionnalités de Python 3 pour la manipulation de fichiers ou de bases de données.\r\n\r\nEnfin, la dernière partie de l'ouvrage est un vaste tutoriel qui permet de mettre en pratique, dans un cadre professionnel, tout ce qui a été vu précédemment en créant une application qui couvre tous les domaines courants du développement (données, Web avec Pyramid, interface graphique avec Gtk, script système...) et ainsi de présenter des solutions efficaces de développement utilisant Python 3."
}
]

